---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.InvalidReflectivityPercentage
source: html/4ce5817d-edc6-8b74-3b36-6cabd8444137.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.InvalidReflectivityPercentage Property

The value for Reflectivity must be between 0 and 1.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidReflectivityPercentage { get; }
```